<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"918b106ca1c3b373762c982d211370edc4f89cbf39cad4e49c4ec113ef84cdc8","plan_job_ref":"Job terraform plan #89 at https://github.com/suzutan/infra/actions/runs/13750103394","plan_out_hash":"c8a8c4e0f374ddbe537bfb0d7774d34219a52a8311bd02319b8d66f22db486b0","plan_hash":"a575ee5f4cc5692a5f390a2ae2a62637772797e5aeb53de2d7fdbac84b65549e","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
!~      config     = {
!~          ingress        = [
!~              {
+                   hostname       = "argocd.harvestasya.org"
!~                  origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "argocd.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "argocd.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
!~                  service        = "http_status:404" -> "https://traefik.traefik.svc.cluster.local"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   hostname       = "echoserver.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "echoserver.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "echoserver.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   hostname       = "id.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "id.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "id.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   hostname       = "asf.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "asf.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "asf.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   hostname       = "navidrome.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "navidrome.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "navidrome.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   hostname       = "navidrome-filebrowser.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "navidrome-filebrowser.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "navidrome-filebrowser.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   hostname       = "influxdb2.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "influxdb2.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "influxdb2.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   origin_request = (known after apply)
+                   service        = "http_status:404"
#                    (1 unchanged attribute hidden)
                },
            ]
+           origin_request = (known after apply)
!~          warp_routing   = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-03-09T15:50:48Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply) # forces replacement
!~      version    = 2 -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.metrics must be replaced
-/+ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "metrics" {
!~      config     = {
!~          ingress        = [
!~              {
+                   hostname       = "grafana.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "grafana.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "grafana.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
!~                  service        = "http_status:404" -> "https://traefik"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   hostname       = "prometheus.harvestasya.org"
+                   origin_request = {
+                       access                 = (known after apply)
+                       connect_timeout        = 10
+                       http_host_header       = "prometheus.harvestasya.org"
+                       keep_alive_connections = 100
+                       keep_alive_timeout     = 90
+                       no_happy_eyeballs      = false
+                       no_tls_verify          = true
+                       origin_server_name     = "prometheus.harvestasya.org"
+                       tcp_keep_alive         = 30
+                       tls_timeout            = 10
#                        (2 unchanged attributes hidden)
                    }
+                   service        = "https://traefik"
#                    (1 unchanged attribute hidden)
                },
+               {
+                   origin_request = (known after apply)
+                   service        = "http_status:404"
#                    (1 unchanged attribute hidden)
                },
            ]
+           origin_request = (known after apply)
!~          warp_routing   = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-03-09T14:39:06Z" -> (known after apply)
!~      id         = "************************************" -> (known after apply) # forces replacement
!~      version    = 1 -> (known after apply)
#        (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #89](https://github.com/suzutan/infra/actions/runs/13750103394)